Revit 2015 API
MaterialNode Class
 This is a class represents a change of material during a model-exporting process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public class MaterialNode : RenderNode
Visual Basic
Public Class MaterialNode _
	Inherits RenderNode
Visual C++
public ref class MaterialNode : public RenderNode
Remarks
 Output nodes following this node are to be assumed using the material. The material remains in effect until another material node is sent to the output.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.MaterialNode
See Also
MaterialNode Members
Autodesk.Revit.DB Namespace